{
    "about_me": "About me",
    "skills": "Skills",
    "projects": "Projects",
    "who_i_am": "Who I Am",
    "about_me_text": "Hi, I'm a german speaking Frontend Developer based in Berlin. Motivated by the limitless opportunities within IT, I am excited about crafting visually captivating and intuitive websites and applications.",
    "location_text": "Flexible in terms of working environments. I can work effectively both on-site in Berlin and remotely.",
    "mindset_text": "I am open-minded and always looking for personal challenges to constantly improve my knowledge.",
    "profession_text": "In my profession, programming isn't just about writing code; it's a creative form of problem-solving. I take pride in my ability to distill complex technical challenges into simple, user-friendly solutions. This way, I help you achieve your goals and bring your visions to life.",
    "frontend_developer": "Frontend Developer",
    "my_work": "Check my work",
    "contact_me": "Contact me",
    "available_for_remote": "Available for Remote work",
    "based_in": "Based in Berlin",
    "open_to_work": "Open to work",
    "technologies": "Technologies",
    "my_journey": "My journey has involved working on diverse projects, employing a range of frontend technologies and concepts. I am open to embracing new technologies and methologies to Contiously enchance my skills and stay ahead in the ever-evolving landscape of web development.",
    "you_need": "You need",
    "another_skill": "another skill",
    "feel_free_to_contact": "Feel free to contact me. I look forward to expanding on my previous knowledge.",
    "lets_talk": "Let's Talk",
    "featured_projects": "Featured Projects",
    "explore_projects": "Explore a selection of my work here - Interact with projects to see my skills in action.",
    "projects_details": "What is this project about?",
    "projectPopUp": {
        "join": {
            "description": "Task manager insoired by the Banban System. Create organize tasks using drag and drop functions, assign users and categories."
        },
        "el_pollo_loco": {
            "description": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen."
        },
        "dabubble": {
            "description": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuituve interface, real-time messaging, and robust channel organization."
        }
    },
    "reviewsTitle": "What my colleagues say about me",
    "reviews": {
        "0": {
            "quote": "Thomas is a highly dedicated employee. His ability to explain complex issues in an understandable way is impressive and helps us stay on track even with challenging tasks. He approaches challenges proactively and often finds creative solutions.",
            "author": "K. Meier - Team Partner"
        },
        "1": {
            "quote": "It’s a pleasure to work with Thomas. He is reliable and very conscientious, which has earned him the trust of the entire team. Even under pressure, he remains calm and supports his colleagues to achieve success together.",
            "author": "L. Schulz - Frontend-Entwickler"
        },
        "2": {
            "quote": "What I particularly appreciate about Thomas is his precise and structured approach to work. He maintains an overview even on large projects and motivates the team with his positive attitude. His dedication and support make him a valuable team member.",
            "author": "M. Becker - Frontend-Entwickler"
        }
    },
    "lets_work": "Let's work",
    "together": "together",
    "problem_to_solve": "Got a problem to solve?",
    "contact_form": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to your projects with my work.",
    "need_developer": "Need a Frontend developer?",
    "customers_name": "Whats's your name?",
    "customers_mail": "What's your email?",
    "customers_concerns": "How can I help you?",
    "placeholder_name": "Your name goes here",
    "placeholder_error_name": "Ops! Your name is missing",
    "placeholder_email": "youremail@email.com",
    "placeholder_error_email": "Hoppla! your email is required",
    "placeholder_message": "Hello Thomas, I am interested in...",
    "placeholder_error_message": "What do you need to develop?",
    "privacy_policy_part1": "I've read the",
    "privacy_policy_part2": "privacy policy",
    "privacy_policy_part3": "and agree to the processing of my data as outlined.",
    "say_hello": "Say Hello ;)",
    "imprint": "Imprint",
    "back_to_homepage": "Back to Homepage",
    "web_developer": "Web Developer",
    "germany": "Berlin, Germany",
    "privacy-policy": "Privacy Policy",
    "preamble": "Preamble",
    "data-processing": "With the following privacy policy, we want to inform you about the types of your personal data (hereinafter referred to as \"data\") that we process, for which purposes, and to what extent. The privacy policy applies to all processing of personal data carried out by us, both in the context of providing our services and, in particular, on our websites, in mobile applications, and within external online presences, such as our social media profiles (hereinafter collectively referred to as \"Online Offer\").",
    "non_gender_specific": "The terms used are not gender-specific.",
    "status_date": "Date: November 19, 2024",
    "contents_overview": "Table of Contents",
    "responsible_person": "Responsible Person",
    "processing_overview": "Overview of Processing Activities",
    "legal_basis": "Relevant Legal Grounds",
    "security_measures": "Security Measures",
    "data_transfer": "Transfer of Personal Data",
    "international_data_transfers": "International Data Transfers",
    "data_storage_and_deletion": "General Information on Data Storage and Deletion",
    "business_services": "Business Services",
    "online_offer_and_webhosting": "Provision of Online Services and Web Hosting",
    "cookie_use": "Use of Cookies",
    "contact_and_inquiry_management": "Contact and Inquiry Management",
    "web_analysis_and_optimization": "Web Analytics, Monitoring, and Optimization",
    "social_media_presences": "Presences on Social Media Networks",
    "plugins_and_embedded_functions": "Plugins and Embedded Functions and Content",
    "changes_and_updates": "Changes and Updates",
    "email_address": "Email address",
    "overview_description": "The following overview summarizes the types of processed data and the purposes of their processing and refers to the affected individuals.",
    "data_types": "Data types",
    "inventory_data": "Inventory data",
    "payment_data": "Payment data",
    "contact_data": "Contact data",
    "content_data": "Content data",
    "contract_data": "Contract data",
    "usage_data": "Usage data",
    "meta_communication_and_procedural_data": "Meta, communication, and procedural data",
    "log_data": "Log data",
    "affected_person_categories": "Categories of Affected Persons",
    "beneficiaries_and_clients": "Beneficiaries and Clients",
    "prospects": "Prospects",
    "communication_partners": "Communication Partners",
    "users": "Users",
    "business_and_contract_partners": "Business and Contract Partners",
    "processing_purposes": "Purposes of Processing",
    "contractual_performance_and_obligations": "Provision of contractual services and fulfillment of contractual obligations",
    "communication": "Communication",
    "reach_measurement": "Reach measurement",
    "office_and_organizational_procedures": "Office and organizational procedures",
    "organizational_and_administrative_procedures": "Organizational and administrative procedures",
    "feedback": "Feedback",
    "user_profiles_with_personal_information": "Profiles with user-related information",
    "online_offer_and_user_friendly_design": "Provision of our online services and user-friendliness",
    "it_infrastructure": "Information technology infrastructure",
    "public_relations": "Public relations",
    "business_processes_and_operations": "Business processes and business management procedures",
    "relevant_legal_basis": "Relevant Legal Grounds",
    "german_data_protection_law_heading": "Relevant Legal Grounds under the german Data Protection Act: ",
    "german_data_protection_law": "If you are located in Germany, we process your data based on the Federal Data Protection Act (German DPA). Unlike, for example, the GDPR, the german DPA does not generally require a legal basis to be specified for the processing of personal data, and the processing of personal data is carried out in good faith, legally, and proportionately (Art. 6 (1) and (2) of the german DPA). Furthermore, personal data is only collected for a specific, identifiable purpose and processed only in a way that is compatible with that purpose (Art. 6 (3) of the german DPA).",
    "security_measures_heading": "Security Measures",
    "security_measures_paragraph_1": "We take appropriate technical and organizational measures, in accordance with legal requirements, considering the state of technology, implementation costs, the nature, scope, circumstances, and purposes of the processing, as well as the varying probabilities of occurrence and the extent of the threat to the rights and freedoms of natural persons, to ensure a level of protection appropriate to the risk.",
    "security_measures_paragraph_2": "The measures include, in particular, ensuring the confidentiality, integrity, and availability of data by controlling physical and electronic access to the data as well as access, input, disclosure, availability protection, and separation. Additionally, we have established procedures that ensure the exercise of data subject rights, the deletion of data, and responses to data threats. Furthermore, we take data protection into account in the development or selection of hardware, software, and procedures, in line with the principle of data protection, through technical design and data protection-friendly default settings.",
    "security_measures_paragraph_3": "Securing online connections using TLS/SSL encryption technology (HTTPS): To protect user data transmitted through our online services from unauthorized access, we use TLS/SSL encryption technology. Secure Sockets Layer (SSL) and Transport Layer Security (TLS) are the cornerstones of secure data transmission on the Internet. These technologies encrypt the information transmitted between the website or app and the user's browser (or between two servers), protecting the data from unauthorized access. TLS, as the more advanced and secure version of SSL, ensures that all data transfers meet the highest security standards. When a website is secured with an SSL/TLS certificate, this is indicated by the display of HTTPS in the URL. This serves as an indicator for users that their data is securely and encrypted during transmission.",
    "data_transmission_heading": "Transmission of Personal Data",
    "data_transmission_paragraph_1": "In the course of processing personal data, it may happen that this data is transmitted or disclosed to other entities, companies, legally independent organizational units, or individuals. The recipients of this data may include, for example, service providers tasked with IT-related functions or providers of services and content integrated into a website. In such cases, we comply with legal requirements and, in particular, enter into appropriate contracts or agreements that serve to protect your data with the recipients of your data.",
    "data_transmission_paragraph_2": "Data transmission within the organization: We may transfer personal data to other departments or units within our organization or grant them access to it. If the data transfer occurs for administrative purposes, it is based on our legitimate business interests or is required to fulfill our contractual obligations, or if consent from the affected individuals or legal authorization is available.",
    "international_data_transfers_heading": "International Data Transfers",
    "international_data_transfers_paragraph_1": "Disclosure of personal data abroad: According to the german DPA, we only disclose personal data abroad if an adequate level of protection for the affected individuals is ensured (Art. 16 german DPA). If the Federal Council has not determined adequate protection (list:",
    "international_data_transfers_paragraph_2": ") we take alternative security measures. These may include international agreements, specific guarantees, data protection clauses in contracts, standard data protection clauses approved by the Federal Data Protection and Information Commissioner (FDPIC), or company-specific data protection regulations pre-approved by the FDPIC or the competent data protection authority of another country. According to Art. 16 of the german DPA, exceptions for the disclosure of data abroad can be permitted if certain conditions are met, including consent from the affected individual, contract execution, public interest, protection of life or physical integrity, publicly disclosed data, or data from a legally required register. These disclosures are always made in compliance with legal requirements. Under the so-called 'Data Privacy Framework' (DPF), Germany has recognized the data protection level for certain companies from the US as secure under the adequacy decision of June 7, 2024. The list of certified companies and further information about the DPF can be found on the website of the US Department of Commerce at",
    "international_data_transfers_paragraph_3": "(in English). We inform you in our privacy notices about which of the service providers we use are certified under the Data Privacy Framework.",
    "general_data_storage_and_deletion_heading": "General Information on Data Storage and Deletion",
    "general_data_storage_and_deletion_paragraph_1": "We delete personal data that we process in accordance with legal provisions as soon as the underlying consents are revoked or no further legal grounds for processing exist. This applies in cases where the original purpose of processing no longer exists or the data is no longer required. Exceptions to this rule apply when legal obligations or special interests require a longer retention or archiving of the data.",
    "general_data_storage_and_deletion_paragraph_2": "In particular, data that must be stored for commercial or tax reasons, or whose storage is necessary for legal proceedings or to protect the rights of other natural or legal persons, must be archived accordingly.",
    "general_data_storage_and_deletion_paragraph_3": "Our privacy notices contain additional information on the retention and deletion of data that specifically applies to certain processing activities.",
    "general_data_storage_and_deletion_paragraph_4": "If there are multiple indications regarding the retention period or deletion deadlines of a data item, the longest period is always decisive.",
    "general_data_storage_and_deletion_paragraph_5": "If a deadline does not explicitly start on a specific date and is at least one year long, it will automatically start at the end of the calendar year in which the triggering event occurred. In the case of ongoing contractual relationships in which data is stored, the triggering event is the date on which the termination or other conclusion of the legal relationship becomes effective.",
    "general_data_storage_and_deletion_paragraph_6": "Data that is no longer required for the originally intended purpose but is retained due to legal requirements or other reasons will be processed exclusively for the purposes that justify its retention.",
    "additional_information_processing_processes_heading": "Further information on processing processes, procedures, and services:",
    "data_storage_and_deletion_heading": "Data Retention and Deletion: ",
    "data_storage_and_deletion_paragraph_1": "The following general periods apply to the storage and archiving according to german law:",
    "storage_period_1": "10 years - Retention period for books and records, annual financial statements, inventories, management reports, opening balances, booking receipts and invoices, as well as all necessary work instructions and other organizational documents (Art. 958f of the german Code of Obligations (OR)).",
    "storage_period_2": "10 years - Data that are necessary to consider potential compensation claims or similar contractual claims and rights, as well as for processing related inquiries, based on past business experiences and usual industry practices, will be stored for the statutory limitation period of ten years, unless a shorter period of five years applies, which is relevant in certain cases (Art. 127, 130 OR). After five years, claims for rent, lease, and capital interest, as well as other periodic services, for the delivery of food, for catering, and for tavern debts, as well as from handicrafts, small sales of goods, medical services, professional work by lawyers, legal agents, procurators, and notaries, and from the employment relationship of employees (Art. 128 OR) are time-barred.",
    "business_services_heading": "Business Services",
    "contractual_and_business_partners_paragraph_1": "We process data of our contractual and business partners, e.g., customers and prospects (referred to collectively as \"contract partners\"), within the framework of contractual and comparable legal relationships, as well as related measures and with regard to communication with contract partners (or pre-contractually), such as answering inquiries.",
    "use_of_data_paragraph_2": "We use this data to fulfill our contractual obligations. This includes, in particular, the obligations to provide the agreed services, any obligations for updates, and remediation of warranty and other performance issues. In addition, we use the data to safeguard our rights and for the purposes of administrative tasks related to these obligations, as well as corporate organization. Furthermore, we process the data based on our legitimate interests both in proper and businesslike management of the company and in security measures to protect our contract partners and our business operations from misuse, endangerment of their data, secrets, information, and rights (e.g., involving telecommunications, transport, and other auxiliary services, as well as subcontractors, banks, tax and legal advisors, payment service providers, or tax authorities). In accordance with applicable law, we only share contract partner data with third parties to the extent necessary for the aforementioned purposes or to fulfill legal obligations. Contract partners will be informed about further forms of processing, such as for marketing purposes, in this privacy policy.",
    "data_requirements_paragraph_3": "We inform contract partners about which data is required for the aforementioned purposes before or during the data collection process, e.g., in online forms, by special markings (e.g., colors) or symbols (e.g., asterisks or similar), or personally.",
    "data_deletion_paragraph_4": "We delete the data after the expiration of statutory warranty and comparable obligations, i.e., in principle after four years, unless the data is stored in a customer account, e.g., as long as it must be retained for legal archival purposes (such as for tax purposes, usually ten years). Data that has been disclosed to us by the contract partner within the framework of an order will be deleted according to the regulations and in principle after the completion of the order.",
    "processed_data_types_strong": "Processed Data Types:",
    "processed_data_types_p": "Master data (e.g., full name, residential address, contact information, customer number, etc.); Payment data (e.g., bank account details, invoices, payment history); Contact data (e.g., postal and email addresses or phone numbers). Contract data (e.g., subject of the contract, duration, customer category).",
    "affected_people_strong": "Affected Persons:",
    "affected_people_p": "Service recipients and clients; prospects. Business and contractual partners.",
    "purposes_of_processing_strong": "Purposes of Processing:",
    "purposes_of_processing_p": "Provision of contractual services and fulfillment of contractual obligations; communication; office and organizational procedures; organizational and administrative procedures. Business processes and business management procedures.",
    "storage_and_deletion_strong": "Storage and Deletion:",
    "storage_and_deletion_p": "Deletion according to the information provided in the section \"General Information on Data Storage and Deletion\".",
    "legal_bases_strong": "Legal Bases:",
    "legal_bases_p": "Contract fulfillment and pre-contractual inquiries (Art. 6(1) Sentence 1 lit. b) GDPR); Legal obligation (Art. 6(1) Sentence 1 lit. c) GDPR). Legitimate interests (Art. 6(1) Sentence 1 lit. f) GDPR).",
    "additional_notes_strong": "Further Notes on Processing Procedures, Practices, and Services:",
    "project_and_development_services_strong": "Project and Development Services:",
    "project_and_development_services_p": "We process the data of our customers and clients (hereinafter collectively referred to as \"customers\") to enable them to select, purchase, or commission the chosen services or works, as well as associated activities, including their payment and provision or execution.",
    "required_information_p": "The necessary information is marked as such within the framework of the contract, order, or comparable contract conclusion and includes the details required for the provision and billing of services, as well as contact information to allow for any necessary follow-ups. Insofar as we gain access to information about end customers, employees, or other individuals, we process this data in accordance with legal and contractual requirements.",
    "legal_bases_span_p": "Contract performance and pre-contractual inquiries (Art. 6(1) Sentence 1 lit. b) GDPR).",
    "h2": "Provision of Online Services and Web Hosting",
    "online_services_p": "We process the data of users to provide them with our online services. For this purpose, we process the IP address of the user, which is necessary to transmit the content and features of our online services to the user’s browser or device.",
    "processed_data_types_li": "Usage data (e.g., page views and duration of visit, click paths, usage intensity and frequency, types of devices and operating systems used, interactions with content and features); Meta, communication, and procedural data (e.g., IP addresses, timestamps, identification numbers, involved individuals); Log data (e.g., log files regarding logins or data retrieval times). Content data (e.g., textual or visual messages and contributions as well as related information, such as authorship details or creation time).",
    "affected_persons_strong": "Data Subjects:",
    "affected_persons_li": "Users (e.g., website visitors, online service users).",
    "purposes_of_processing_li": "Provision of our online offer and user-friendliness; IT infrastructure (operation and provision of information systems and technical devices, such as computers, servers, etc.). Security measures.",
    "retention_and_deletion_strong": "Retention and Deletion:",
    "retention_and_deletion_li": "Deletion in accordance with the information in the section “General Information on Data Storage and Deletion.”",
    "legal_bases_li": "Legitimate interests (Art. 6(1) Sentence 1 lit. f) GDPR).",
    "p1": "Further information on processing procedures, methods, and services:",
    "hosting_strong": "Provision of online services on rented storage space:",
    "hosting_text": "To provide our online offering, we use storage space, computing capacity, and software rented or otherwise obtained from a corresponding server provider (also referred to as \"web host\");",
    "logfiles_strong": "Collection of access data and log files:",
    "logfiles_text": "Access to our online offering is recorded in the form of so-called \"server log files.\" These server log files may include the address and name of the retrieved web pages and files, date and time of retrieval, transferred data volumes, a message about successful retrieval, browser type and version, the user's operating system, referrer URL (the previously visited page), and, as a rule, IP addresses and the requesting provider. The server log files can be used for security purposes, e.g., to prevent server overload (especially in the case of abusive attacks, so-called DDoS attacks), and to ensure server utilization and stability;",
    "logfiles_deletion_strong": "Deletion of data:",
    "logfiles_deletion": "Log file information is stored for a maximum period of 30 days and then deleted or anonymized. Data whose further retention is required for evidentiary purposes are excluded from deletion until the respective incident has been finally resolved.",
    "email_hosting_strong": "Email sending and hosting:",
    "email_text": "The web hosting services we use also include the sending, receiving, and storage of emails. For these purposes, we process recipients' and senders' addresses and other information about the email transmission (e.g., the participating providers) and the contents of the respective emails. The aforementioned data may also be processed to detect SPAM. Please note that emails are generally not encrypted when sent over the Internet. Emails are usually encrypted during transmission but not on the servers from which they are sent and received (unless an end-to-end encryption method is used). We therefore cannot assume responsibility for the transmission path of emails between the sender and reception on our server;",
    "cookie_usage_h2": "Use of Cookies",
    "cookie_description_p1": "The term \"cookies\" refers to functions that store and read information on users' devices. Cookies may be used for various purposes, such as ensuring the functionality, security, and convenience of online offerings, as well as creating analyses of visitor flows. We use cookies in accordance with legal regulations. Where necessary, we obtain users' consent in advance. If consent is not required, we rely on our legitimate interests. This applies when storing and reading information is essential to provide specifically requested content and features. These include storing settings and ensuring the functionality and security of our online offering. Consent can be revoked at any time. We provide clear information on the scope and types of cookies used.",
    "law_notes_strong": "Notes on data protection legal basis:",
    "law_notes": "Whether we process personal data using cookies depends on consent. If consent is given, it serves as the legal basis. Without consent, we rely on our legitimate interests as outlined in this section and in the context of the respective services and procedures.",
    "storage_duration_strong": "Storage duration:",
    "storage_duration": "With regard to storage duration, the following types of cookies are distinguished:",
    "temp_cookies_strong": "Temporary Cookies (also: Session or Session Cookies):",
    "temp_cookies": "Temporary cookies are deleted at the latest after a user leaves an online service and closes their device (e.g., browser or mobile application).",
    "perm_cookies_strong": "Permanent Cookies:",
    "perm_cookies": "Permanent cookies remain stored even after the device is closed. For example, the login status can be saved and preferred content displayed directly when the user revisits a website. User data collected with cookies may also be used for reach measurement. Unless users are explicitly informed about the type and duration of cookies (e.g., when consent is obtained), they should assume these are permanent and that the storage duration may be up to two years.",
    "general_revocation_notice_strong": "General Information on Revocation and Objection (Opt-out):",
    "general_revocation_notice": "Users can revoke their consent at any time and also object to the processing according to legal requirements, including through the privacy settings of their browser.",
    "additional_processing_information_strong": "Further Information on Processing Procedures, Methods, and Services:",
    "additional_processing_information": "",
    "cookie_data_processing_strong": "Processing of Cookie Data Based on Consent:",
    "cookie_data_processing": "We use a consent management solution to obtain user consent for the use of cookies or for the procedures and providers specified within the consent management solution. This process is used to obtain, log, manage, and revoke consent, especially regarding the use of cookies and similar technologies that store, read, and process information on users' devices. In this process, user consent is obtained for the use of cookies and the associated data processing, including specific processing operations and providers mentioned in the consent management process. Users also have the option to manage and withdraw their consent. Consent declarations are stored to avoid repeated requests and to demonstrate consent as required by law. Storage occurs server-side and/or in a cookie (so-called opt-in cookie) or using similar technologies to assign consent to a specific user or device. In the absence of specific information about consent management service providers, the following general notes apply: The consent storage duration is up to two years. A pseudonymous user identifier is created, which is stored together with the time of consent, details about the scope of consent (e.g., relevant categories of cookies and/or service providers), and information about the browser, system, and device used.",
    "contact_management_heading": "Contact and Inquiry Management",
    "contact_management_paragraph": "When contacting us (e.g., by mail, contact form, email, phone, or via social media) and in the context of existing user and business relationships, the information of the inquiring individuals is processed as necessary to respond to inquiries and any requested actions.",
    "processed_data_types": "Master data (e.g., full name, residential address, contact information, customer number, etc.); Contact data (e.g., postal and email addresses or phone numbers); Content data (e.g., textual or visual messages and posts, including related information such as author information or creation time); Usage data (e.g., page views, duration of stay, click paths, usage intensity and frequency, types of devices and operating systems used, interactions with content and features). Meta, communication, and procedural data (e.g., IP addresses, timestamps, identification numbers, involved persons).",
    "affected_persons": "Communication partners.",
    "processing_purposes_strong": "Purposes of Processing:",
    "storage_and_deletion": "Deletion according to the information in the section 'General Information on Data Storage and Deletion'.",
    "legal_bases": "Legitimate interests (Art. 6 (1) sentence 1 lit. f) GDPR). Contract fulfillment and pre-contractual inquiries (Art. 6 (1) sentence 1 lit. b) GDPR).",
    "additional_processing_info_heading": "Additional Information on Processing Procedures, Processes, and Services:",
    "contact_form_strong": "Contact Form:",
    "web_analysis_heading": "Web Analytics, Monitoring, and Optimization",
    "web_analysis_1": "Web analytics (also known as \"reach measurement\") is used to evaluate the flow of visitors to our online offering and may include behavior, interests, or demographic information about visitors, such as age or gender, in pseudonymous values. With the help of reach analysis, we can determine, for example, at what time our online offering or its functions or content are most frequently used, or invite users to revisit. It also allows us to identify areas that need optimization.",
    "web_analysis_2": "In addition to web analytics, we can also use testing procedures to test and optimize different versions of our online offering or its components.",
    "web_analysis_3": "Unless otherwise specified below, profiles, which are summarized data about a usage process, may be created for these purposes, and information may be stored and read from a browser or end device. The collected information includes, in particular, visited websites and the elements used there, as well as technical information such as the browser used, the computer system used, and information about usage times. If users have agreed to the collection of their location data either with us or with the providers of the services we use, the processing of location data is also possible.",
    "web_analysis_4": "In addition, the IP addresses of users are stored. However, we use an IP-masking procedure (i.e., pseudonymization by shortening the IP address) to protect the users. In general, no clear data of users (such as email addresses or names) are stored as part of web analytics, A/B testing, and optimization, but pseudonyms are used. This means that neither we nor the providers of the software we use know the actual identity of the users, only the data stored in their profiles for the purpose of the respective procedures.",
    "legal_bases_heading": "Legal Basis Information: If we ask users for their consent to use third-party providers, the legal basis for data processing is the consent. Otherwise, user data is processed based on our legitimate interests (i.e., interest in efficient, economical, and user-friendly services). In this context, we would also like to refer you to the information regarding the use of cookies in this privacy policy.",
    "processed_data_description": "Usage data (e.g., page views and duration of stay, click paths, usage intensity and frequency, device types and operating systems used, interactions with content and functions). Meta, communication, and procedural data (e.g., IP addresses, timestamps, identification numbers, involved persons).",
    "affected_persons_description": "Users (e.g., website visitors, online service users).",
    "processing_purposes_description": "Reach measurement (e.g., access statistics, identification of returning visitors); profiles with user-related information (creating user profiles). Provision of our online offering and user-friendliness.",
    "storage_and_deletion_description": "Deletion as per information provided in the \"General Information on Data Storage and Deletion\" section. Storage of cookies for up to 2 years (unless otherwise specified, cookies and similar storage methods may be stored on users' devices for a period of two years).",
    "security_measures_description": "IP masking (pseudonymization of IP address).",
    "further_information": "Further Information on Processing Procedures, Processes, and Services:",
    "google_analytics": "Google Analytics:",
    "google_analytics_description": "We use Google Analytics to measure and analyze the use of our online offering based on a pseudonymous user identification number. This ID does not contain specific data, such as names or email addresses, and serves to associate analytical information with a device to track what content users accessed within one or several usage processes, what search terms they used, or if they interacted with our online offering. Time of use and its duration, as well as the sources referring users to our online offering and technical aspects of their devices and browsers, are also recorded.",
    "google_analytics_break_1": "Pseudonymous user profiles with information from multiple device uses may be created, where cookies can be used. Google Analytics does not record or store individual IP addresses for EU users. However, Analytics provides approximate geographical location data by deriving the following metadata from IP addresses: city (and derived latitude and longitude), continent, country, region, subcontinent (and ID-based counterparts). For EU data traffic, IP address data is used exclusively for this geolocation derivation before immediate deletion. IP data is not logged, accessible, or used for any further purposes. When Google Analytics collects measurement data, all IP queries are conducted on EU-based servers before traffic is forwarded to Analytics servers for processing.",
    "service_provider": "Service Provider:",
    "service_provider_description": "Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Ireland;",
    "legal_bases_description": "Consent (Art. 6 para. 1 sentence 1 lit. a) GDPR);",
    "strong_website": "Website:",
    "strong_security_measures": "Security Measures:",
    "strong_ip_masking": "IP masking (pseudonymization of the IP address);",
    "strong_privacy_policy": "Privacy Policy:",
    "strong_data_processing_agreement": "Data Processing Agreement:",
    "strong_third_country_transfer_basis": "Basis for Third Country Transfer:",
    "adequacy_decision": "Adequacy decision (Ireland);",
    "strong_opt_out_option": "Opt-out Option:",
    "legal_bases_opt_out_plugin": "Opt-out plugin",
    "legal_bases_personalization_settings": "Settings for Ad Display Personalization",
    "legal_bases_further_information": "Further Information:",
    "legal_bases_processing_types": "(Types of processing and processed data)",
    "social_media_description": "We maintain online presences within social networks and process user data in this context to communicate with active users there or offer information about us.",
    "social_media_warning": "We point out that user data may be processed outside the European Union. This may pose risks for users, as enforcing user rights could be more difficult.",
    "social_media_data_processing": "Furthermore, user data within social networks is usually processed for market research and advertising purposes. For example, based on user behavior and resulting interests, user profiles may be created. These profiles might then be used to display ads both inside and outside the networks that are presumed to match the users' interests. Therefore, cookies are typically stored on users' devices that store the users' behavior and interests. Additionally, user data may be stored in the profiles regardless of the devices used by the users (especially if they are members of the respective platforms and logged in).",
    "social_media_privacy": "For a detailed representation of the respective processing types and opt-out options, we refer to the privacy policies and information provided by the operators of the respective networks.",
    "social_media_requests": "In the case of requests for information and the assertion of data subject rights, we point out that these can be most effectively asserted with the providers. Only the providers have access to user data and can take direct action and provide information. If you still need assistance, you can contact us.",
    "further_notes_on_processing": "Further notes on processing processes, procedures, and services:",
    "linkedin": "LinkedIn: ",
    "linkedin_description": "Social network - Together with LinkedIn Ireland Unlimited Company, we are responsible for the collection (but not further processing) of data from visitors, which is used to create the \"Page Insights\" (statistics) of our LinkedIn profiles. This data includes information about the types of content users view or interact with, as well as actions they perform. Details about the devices used are also collected, such as IP addresses, operating system, browser type, language settings, and cookie data, as well as details from user profiles such as job function, country, industry, hierarchy level, company size, and employment status. Privacy information regarding the processing of user data by LinkedIn can be found in LinkedIn's privacy policy: ",
    "agreement_with_linkedin": "We have entered into a special agreement with LinkedIn Ireland (\"Page Insights Joint Controller Addendum\", ",
    "agreement_description": "), which specifically regulates the security measures LinkedIn must adhere to, and in which LinkedIn has committed to fulfilling the rights of the data subjects (e.g., users can directly send requests for information or deletion to LinkedIn). The rights of users (especially the right to access, deletion, objection, and complaints to the relevant supervisory authority) are not restricted by the agreements with LinkedIn. Joint responsibility is limited to the collection and transmission of data to LinkedIn Ireland Unlimited Company, a company based in the EU. The further processing of the data is exclusively the responsibility of LinkedIn Ireland Unlimited Company, especially with regard to the transmission of data to the parent company, LinkedIn Corporation, in the USA.",
    "legitimate_interests": "Legitimate Interests (Art. 6 para. 1 sentence 1 lit. f) GDPR);",
    "linkedin_provider": "LinkedIn Ireland Unlimited Company, Wilton Place, Dublin 2, Ireland;",
    "m328_title": "Plugins and Embedded Features and Content",
    "plug_in_description": "We integrate functional and content elements into our online offering, which are retrieved from the servers of their respective providers (hereinafter referred to as 'third parties'). These may include, for example, graphics, videos, or maps (collectively referred to as 'content').",
    "data_processing_info": "The integration always requires that the third-party providers of this content process the users' IP address, as they could not send the content to their browser without the IP address. The IP address is therefore required for the display of this content or features. We strive to use only content from providers who use the IP address solely for the delivery of the content. Third parties may also use so-called pixel tags (invisible graphics, also known as 'web beacons') for statistical or marketing purposes. Through the 'pixel tags', information such as visitor traffic on the pages of this website can be analyzed. The pseudonymous information may also be stored in cookies on the users' devices and may contain technical information about the browser and operating system, referring websites, visit times, and further details regarding the use of our online services, but can also be combined with such information from other sources.",
    "legal_bases_notes": "Notes on Legal Bases:",
    "legal_bases_consent": "If we ask users for their consent to use third-party services, the legal basis for data processing is consent. Otherwise, user data is processed based on our legitimate interests (i.e., interest in efficient, cost-effective, and user-friendly services). In this context, we also want to refer you to the information on the use of cookies in this privacy policy.",
    "third_party_software_integration": "Integration of Third-Party Software, Scripts, or Frameworks (e.g., jQuery):",
    "third_party_software_integration_description": "We integrate software into our online offering that we retrieve from the servers of other providers (e.g., functional libraries used to display or enhance the user-friendliness of our online services). The respective providers collect the users' IP addresses and may process them for the purposes of delivering the software to the users' browsers, as well as for security purposes, and for evaluating and optimizing their services.",
    "google_fonts_server_hosting": "Google Fonts (Hosting on Own Server):",
    "google_fonts_server_hosting_description": "Providing font files for a user-friendly display of our online services. The Google Fonts are hosted on our server, and no data is transmitted to Google.",
    "additional_processing_notes": "Further Notes on Processing Procedures, Processes, and Services:",
    "google_fonts_hosted": "The Google Fonts are hosted on our server, no data is transmitted to Google.",
    "myfonts": "MyFonts:",
    "font_data": "Fonts; processed data in the context of font retrieval includes the identification number of the web font project (anonymized), the URL of the licensed website, linked with a customer number to identify the licensee and the licensed web fonts, and the referrer URL. The anonymized web font project identification number is stored in encrypted log files with such data for 30 days to determine the monthly number of page views; after this extraction and storage of the page view count, the log files are deleted.",
    "monotype": "Monotype Imaging Holdings Inc., 600 Unicorn Park Drive, Woburn, Massachusetts 01801, USA;",
    "website": "Website:",
    "privacy_policy": "Privacy Policy:",
    "changes_and_updates_title": "Changes and Updates",
    "changes_and_updates_paragraph_1": "We ask you to regularly check the content of our privacy policy. We will adjust the privacy policy as soon as changes to the data processing we perform make this necessary. We will inform you when these changes require an action on your part (e.g., consent) or any other individual notification.",
    "changes_and_updates_paragraph_2": "If we provide addresses and contact information for companies and organizations in this privacy policy, please note that these addresses may change over time and we ask you to check the information before contacting them.",
    "created_with_privacy_generator": "Created with the free Privacy Generator by Dr. Thomas Schwenke",
    "email_sent_successfully": "The email was sent successfully. I will get back to you as soon as possible.",
    "email_is_not_correct": "The email address is not valid.",
    "privacy_policy_error": "Please accept the privacy policy."
}